app/Http/Controllers/Web/ProductController.php

select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 6, 7)
select * from `inventory` where `inventory`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
select * from `products` where `is_available` = 1 order by `name` asc limit 12 offset 0
select count(*) as aggregate from `products` where `is_available` = 1
select * from `categories` order by `name` asc
---
    public function index(Request $request)
    {
        $products = Product::with(['category', 'inventory'])
            ->where('is_available', true) // Only show available products
            ->when($request->search, function ($query, $search) {
                $query->where('name', 'like', "%{$search}%")
                      ->orWhere('description', 'like', "%{$search}%");
            })
            ->when($request->category_id, function ($query, $categoryId) {
                $query->where('category_id', $categoryId);
            })
            ->orderBy('name')
            ->paginate(12);

        $categories = Category::orderBy('name')->get();