app/Models/User.php

    public function hasRole(string $roleName): bool
    {
        // First check the role field for backward compatibility
        if ($this->role === $roleName) {
            return true;
        }

        // Then check the dynamic roles
        return $this->roles()->where('name', $roleName)->exists();
---
select exists(select * from `roles` inner join `user_roles` on `roles`.`id` = `user_roles`.`role_id` where `user_roles`.`user_id` = 12 and `name` = 'admin') as `exists`