app/Http/Controllers/Dashboard/DashboardController.php

select * from `orders` where `orders`.`customer_id` = 12 and `orders`.`customer_id` is not null order by `created_at` desc limit 5
select count(*) as aggregate from `orders` where `orders`.`customer_id` = 12 and `orders`.`customer_id` is not null and `status` = 'delivered'
---
    public function adminDashboard()
    {
        // Sales statistics
        $todaySales = Order::whereDate('created_at', today())->sum('total');
        $monthSales = Order::whereMonth('created_at', now()->month)->sum('total');
        $totalOrders = Order::count();
        $pendingOrders = Order::where('status', 'pending')->count();

        // Low stock alerts
        $lowStockItems = Inventory::with('product')
            ->whereRaw('quantity <= minimum_stock')
            ->take(5)
            ->get();

        // Recent orders with location data
        $recentOrders = Order::with(['customer', 'bill'])
            ->latest()
            ->take(10)
            ->get();

        // New orders (last 24 hours) for notifications
        $newOrders = Order::where('created_at', '>=', now()->subDay())
            ->with(['customer', 'bill'])
            ->latest()
            ->get();

        // Top selling products with category information
        $topProducts = Product::with(['category', 'inventory'])
            ->withCount(['orderItems as total_sales' => function ($query) {
                $query->whereHas('order', function ($q) {
                    $q->where('status', 'delivered');
                });
            }])
            ->where('is_available', true)
            ->orderBy('total_sales', 'desc')
            ->take(10)
            ->get();