app/Http/Controllers/Dashboard/DashboardController.php

    public function adminDashboard()
    {
        // Sales statistics
        $todaySales = Order::whereDate('created_at', today())->sum('total');
        $monthSales = Order::whereMonth('created_at', now()->month)->sum('total');
        $totalOrders = Order::count();
        $pendingOrders = Order::where('status', 'pending')->count();

        // Low stock alerts
        $lowStockItems = Inventory::with('product')
            ->whereRaw('quantity <= minimum_stock')
            ->take(5)
            ->get();

        // Recent orders with location data
        $recentOrders = Order::with(['customer', 'bill'])
            ->latest()
            ->take(10)
            ->get();

        // New orders (last 24 hours) for notifications
        $newOrders = Order::where('created_at', '>=', now()->subDay())
            ->with(['customer', 'bill'])
            ->latest()
            ->get();

        // Top selling products
        $topProducts = Product::withCount('orderItems')
            ->orderBy('order_items_count', 'desc')
            ->take(5)
            ->get();

        return Inertia::render('Dashboard/Admin', [
            'user' => Auth::user(),
            'stats' => [
                'total_revenue' => $todaySales,
                'orders_today' => Order::whereDate('created_at', today())->count(),
                'active_products' => Product::where('is_available', true)->count(),
                'low_stock_count' => Inventory::whereRaw('quantity <= minimum_stock')->count(),
                'new_orders_count' => $newOrders->count(),
            ],
            'todaySales' => $todaySales,
            'monthSales' => $monthSales,
            'totalOrders' => $totalOrders,
            'pendingOrders' => $pendingOrders,
            'lowStockItems' => $lowStockItems,
            'recentOrders' => $recentOrders,
            'newOrders' => $newOrders,
            'topProducts' => $topProducts,
        ]);
---
select sum(`total`) as aggregate from `orders` where date(`created_at`) = '2025-10-10'
select sum(`total`) as aggregate from `orders` where month(`created_at`) = '10'
select count(*) as aggregate from `orders`
select count(*) as aggregate from `orders` where `status` = 'pending'
select * from `inventory` where quantity <= minimum_stock limit 5
select * from `products` where `products`.`id` in (4, 6, 11, 12, 13)
select * from `bills` where `bills`.`order_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `orders` order by `created_at` desc limit 10
select `products`.*, (select count(*) from `order_items` where `products`.`id` = `order_items`.`product_id`) as `order_items_count` from `products` order by `order_items_count` desc limit 5
select count(*) as aggregate from `orders` where date(`created_at`) = '2025-10-10'
select count(*) as aggregate from `products` where `is_available` = 1
select count(*) as aggregate from `inventory` where quantity <= minimum_stock