app/Http/Controllers/Dashboard/OrderController.php

    public function index(Request $request)
    {
        $orders = Order::query()
            ->with(['customer', 'items.product', 'bill'])
            ->when($request->search, function ($query, $search) {
                $query->where('order_number', 'like', "%{$search}%")
                    ->orWhereHas('customer', function ($q) use ($search) {
                        $q->where('name', 'like', "%{$search}%")
                          ->orWhere('email', 'like', "%{$search}%");
                    });
            })
            ->when($request->status, function ($query, $status) {
                $query->where('status', $status);
            })
            ->latest()
            ->paginate(15);
---
select * from `bills` where `bills`.`order_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
select * from `orders` order by `created_at` desc limit 15 offset 0
select * from `products` where `products`.`id` in (1, 2, 3, 4, 5, 6, 7, 9, 10)
select count(*) as aggregate from `orders`