app/Http/Controllers/Dashboard/ProductController.php

    public function index(Request $request)
    {
        $products = Product::with(['category', 'inventory'])
            ->when($request->search, function ($query, $search) {
                $query->where('name', 'like', "%{$search}%")
                      ->orWhere('description', 'like', "%{$search}%");
            })
            ->when($request->category_id, function ($query, $categoryId) {
                $query->where('category_id', $categoryId);
            })
            ->when($request->availability, function ($query, $availability) {
                if ($availability === 'available') {
                    $query->where('is_available', true);
                } elseif ($availability === 'unavailable') {
                    $query->where('is_available', false);
                }
            })
            ->orderBy('name')
            ->paginate(15);

        $categories = Category::orderBy('name')->get();
---
select * from `categories` where `categories`.`id` in (1, 2, 3, 4, 6, 7)
select * from `inventory` where `inventory`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13)
select * from `products` order by `name` asc limit 15 offset 0
select count(*) as aggregate from `products`
select * from `categories` order by `name` asc

    public function create()
    {
        $categories = Category::orderBy('name')->get();
---
select * from `categories` order by `name` asc