app/Http/Controllers/Dashboard/SupplierController.php

select * from `suppliers` order by `name` asc limit 15 offset 0
select count(*) as aggregate from `suppliers`
---
    public function index(Request $request)
    {
        $suppliers = Supplier::query()
            ->when($request->search, function ($query, $search) {
                $query->where('name', 'like', "%{$search}%")
                      ->orWhere('email', 'like', "%{$search}%")
                      ->orWhere('contact_person', 'like', "%{$search}%");
            })
            ->orderBy('name')
            ->paginate(15);